@echo off

chcp 65001 > nul

setlocal

echo ====================================================================

echo   АВТОМАТИЧЕСКИЙ ТЕСТ МУЛЬТИКЛИЕНТСКОГО UDP-СЕРВЕРА (PYTHON)

echo   Лабораторная работа №1 по дисциплине «Параллельное программирование»

echo   Автор: Эрденко М. Д. (ПО-32б) -- Преподаватель: Степаков В. И.

echo ====================================================================

echo.

echo Внимание: Перед запуском данного теста в отдельном окне должен

echo быть запущен сервер через "2_Запуск_Сервера.bat".

echo.

echo Запуск run_test.py...

echo --------------------------------------------------------------------

set "PYTHONIOENCODING=utf-8"
python run_test.py

echo.

echo [ИНФО] Тестирование завершено.

pause


